---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeStructuralDepthOnLanding
source: html/a5a3e010-a937-bd1a-8b0f-7f6771fae7ac.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeStructuralDepthOnLanding Property

"Structural Depth On Landing": Structural Depth

## Syntax (C#)
```csharp
public static ForgeTypeId StairsSupporttypeStructuralDepthOnLanding { get; }
```